## Handling Categorical variables

In [1]:
import pandas as pd

/home/mo/anaconda3/envs/ml35/lib/python3.5/importlib/_bootstrap.py:222: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [31]:
df = pd.read_csv('data.csv')
df

   Country  Age  Salary Purchased
0   France   32   65000        No
1    Spain   34   56000       Yes
2  Germany   40   62000        No
3    Spain   48   72000        No
4  Germany   31   65000       Yes
5   France   27   66000        No
6    Spain   38   48000       Yes
7   France   50   54000       Yes
8  Germany   37   39000        No
9   France   44   67000       Yes

In [32]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [33]:
le = LabelEncoder()

In [34]:
# df.iloc[:, 0] = le.fit_transform(df.iloc[:, 0])

In [44]:
print("Original features ", list(df.columns))
data_dummies = pd.get_dummies(df)
print("Features after OneHotEncoding ", list(data_dummies))

Original features  ['Country', 'Age', 'Salary', 'Purchased']
Features after OneHotEncoding  ['Age', 'Salary', 'Country_France', 'Country_Germany', 'Country_Spain', 'Purchased_No', 'Purchased_Yes']

In [46]:
new_df = data_dummies

In [47]:
new_df

,Age,Salary,Country_France,Country_Germany,Country_Spain,Purchased_No,Purchased_Yes
0,32,65000,1,0,0,1,0
1,34,56000,0,0,1,0,1
2,40,62000,0,1,0,1,0
3,48,72000,0,0,1,1,0
4,31,65000,0,1,0,0,1
5,27,66000,1,0,0,1,0
6,38,48000,0,0,1,0,1
7,50,54000,1,0,0,0,1
8,37,39000,0,1,0,1,0
9,44,67000,1,0,0,0,1

## Now I have converted categorical variables into 1 and 0 and data is ready for model training